// General purpose
"CONTINUE_BUTTON" = "Continue";
"CANCEL_BUTTON" = "Cancel";

// Missing Address Book "Me" card
"MISSING_ME_CARD_MESSAGE" = "No “Me” card found";
"MISSING_ME_CARD_INFO" = "In order to respond to invitations in iCal, you must have an Address Book card representing you with the email address you use for Google Calendar. If you will be receiving invitations for calendar events, you should add a card for yourself in Address Book and choose “Make This My Card” from the Card menu.";
"LAUNCH_ADDRESS_BOOK_BUTTON" = "Open Address Book";

// Missing email address in Addres Book
"MISSING_EMAIL_MESSAGE" = "Add this email address to your Address Book card?";
"MISSING_EMAIL_INFO_FORMAT" = "In order to respond to invitations in iCal, your Address Book card must contain the email address you use for Google Calendar. Would you like to add “%@” to your Address Book card?";
"ADD_EMAIL_BUTTON" = "Add Email";
"DONT_ADD_EMAIL_BUTTON" = "Don’t Add";

// iCal quit enforcing
"QUIT_ICAL_MESSAGE" = "Please quit iCal";
"QUIT_ICAL_INFO" = "iCal must not be running while your calendars are set up. Please quit iCal before continuing.";

// failed login
"AUTH_FAIL_MESSAGE" = "Authentication failed";
"AUTH_FAIL_INFO" = "Please check that your password and/or email address is correct.";

// individual calendar failures
"CALENDAR_ADD_ERROR_MESSAGE" = "Error adding calendars";
"CALENDAR_ADD_ERROR_INFO_FORMAT" = "There were errors adding the following calendars to iCal: %@";

// complete setup failure
"SETUP_ERROR_MESSAGE" = "Error configuring iCal";
"SETUP_ERROR_INFO_FORMAT" = "iCal setup failed because iCal's cache could not be removed. To complete setup, please remove the file “%@” then launch iCal.";

// setup completed
"SUCCESS_MESSAGE" = "Setup complete";
"SUCCESS_INFO" = "Your calendars have been successfully added to iCal.";
"LAUNCH_ICAL_BUTTON" = "Open iCal";
"QUIT_BUTTON" = "Quit";

// setup changed nothing
"NO_CHANGE_MESSAGE" = "No calendars selected";
"NO_CHANGE_INFO" = "No calendars were selected to add to iCal. Please select one or more calendars, and try again.";
